____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_1 (InputLayer)                          (None, 3, 3)                   0                                                              
____________________________________________________________________________________________________________________________________________
flatten_1 (Flatten)                           (None, 9)                      0               input_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
dense_1 (Dense)                               (None, 256)                    2560            flatten_1[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)    (None, 256)                    1024            dense_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
activation_1 (Activation)                     (None, 256)                    0               batch_normalization_1[0][0]                    
____________________________________________________________________________________________________________________________________________
dense_2 (Dense)                               (None, 128)                    32896           activation_1[0][0]                             
____________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)    (None, 128)                    512             dense_2[0][0]                                  
____________________________________________________________________________________________________________________________________________
activation_2 (Activation)                     (None, 128)                    0               batch_normalization_2[0][0]                    
____________________________________________________________________________________________________________________________________________
pi (Dense)                                    (None, 9)                      1161            activation_2[0][0]                             
____________________________________________________________________________________________________________________________________________
v (Dense)                                     (None, 1)                      129             activation_2[0][0]                             
============================================================================================================================================
Total params: 38,282
Trainable params: 37,514
Non-trainable params: 768
____________________________________________________________________________________________________________________________________________
